# Год: 1, 21, 31, 41, 51, 61, 71, 81, 91, 101, 121, 131, 141, 151

# Года:
#   2,   3,   4,
#  22,  23,  24,
#  32,  33,  34,
#  42,  43,  44,
#  52,  53,  54,
#  62,  63,  64,
#  72,  73,  74,
#  82,  83,  84,
#  92,  93,  94,
# 102, 103, 104,

# Лет:
#   5,   6,   7,   8,   9,  10, 11, 12, 13, 14,
#  15,  16,  17,  18,  19,  20,
#  25,  26,  27,  28,  29,  30,
#  35,  36,  37,  38,  39,  40,
#  45,  46,  47,  48,  49,  50,
#  55,  56,  57,  58,  49,  60,
#  75,  76,  77,  78,  79,  80,
#  85,  86,  87,  88,  89,  90,
#  95,  96,  97,  98,  99, 100,
# 105, 106, 107, 108, 109, 110, 111, 112, 113, 114,
# 115, 116, 117, 118, 119, 120,

user_input_age = input('Введите Ваш возрас: ')

if user_input_age.isdigit():
    mod_age_100 = int(user_input_age) % 100
    mod_age_10 = mod_age_100 % 10
    if mod_age_10 == 1 and mod_age_100 != 11:
        print(user_input_age, 'Год')
    elif mod_age_10 in (2, 3, 4) and mod_age_100 not in (12, 13, 14):
        print(user_input_age, 'Года')
    else:
        print(user_input_age, 'Лет')
elif user_input_age.isalpha():
    print('Что такое "{}"? Я понимаю только целые числа.'.format(user_input_age))
